[{
  "_id": {
    "$oid": "61d6e2b49873f88eb431b7f2"
  },
  "title": "The Professional",
  "original_title": "Léon",
  "description": "Mathilda (Natalie Portman) is only 12 years old, but is already familiar with the dark side of life: her abusive father stores drugs for corrupt police officers, and her mother neglects her. Léon (Jean Reno), who lives down the hall, tends to his houseplants and works as a hired hitman for mobster Tony (Danny Aiello). When her family is murdered by crooked DEA agent Stansfield (Gary Oldman), Mathilda joins forces with a reluctant Léon to learn his deadly trade and avenge her family's deaths. ",
  "director": "61d9b8b5f4d351b6f5e3adf2",
  "release_date": "1994",
  "rt_score": "74",
  "poster": "https://www.themoviedb.org/t/p/original/kOzpmWF3CtXwQUapEJDuzLouAPk.jpg",
  "roles": []
},{
  "_id": {
    "$oid": "61d6e2b49873f88eb431b7f3"
  },
  "title": "Jurassic Park",
  "original_title": "Jurassic Park",
  "description": "In Steven Spielberg's massive blockbuster, paleontologists Alan Grant (Sam Neill) and Ellie Sattler (Laura Dern) and mathematician Ian Malcolm (Jeff Goldblum) are among a select group chosen to tour an island theme park populated by dinosaurs created from prehistoric DNA. While the park's mastermind, billionaire John Hammond (Richard Attenborough), assures everyone that the facility is safe, they find out otherwise when various ferocious predators break free and go on the hunt. ",
  "director": "61d9b88bf4d351b6f5e3adf1",
  "release_date": "1993",
  "rt_score": "92",
  "poster": "https://m.media-amazon.com/images/I/71geExABv4L._AC_SY606_.jpg",
  "roles": []
},{
  "_id": {
    "$oid": "61d6e2b49873f88eb431b7f4"
  },
  "title": "Back To The Future",
  "original_title": "Back To The Future",
  "description": "In this 1980s sci-fi classic, small-town California teen Marty McFly (Michael J. Fox) is thrown back into the '50s when an experiment by his eccentric scientist friend Doc Brown (Christopher Lloyd) goes awry. Traveling through time in a modified DeLorean car, Marty encounters young versions of his parents (Crispin Glover, Lea Thompson), and must make sure that they fall in love or he'll cease to exist. Even more dauntingly, Marty has to return to his own time and save the life of Doc Brown. ",
  "director": "61d9b828f4d351b6f5e3adf0",
  "release_date": "1985",
  "rt_score": "96",
  "poster": "https://static.posters.cz/image/750/affiches-et-posters/back-to-the-future-i2795.jpg",
  "roles": [
    {
      "name": "Marty McFly",
      "actor": "61dc795692519e55dbffc334"
    },
    {
      "name": " Emmett \"Doc\" Brown",
      "actor": "61dca64092519e55dbffc34d"
    },
    {
      "name": "",
      "actor": "61dcc41117a6da7e128cb4f2"
    }
  ]
},{
  "_id": {
    "$oid": "61d6e2b49873f88eb431b7f5"
  },
  "title": "Back to the Future Part II",
  "original_title": "Back to the Future",
  "description": "In this zany sequel, time-traveling duo Marty McFly (Michael J. Fox) and Dr. Emmett Brown (Christopher Lloyd) return from saving Marty's future son from disaster, only to discover their own time transformed. In this nightmarish version of Hill Valley, Marty's father has been murdered and Biff Tannen, Marty's nemesis, has profited. After uncovering the secret to Biff's success -- a sports almanac from the future -- Marty and the Doc embark on a quest to repair the space-time continuum.",
  "director": "61d9b828f4d351b6f5e3adf0",
  "release_date": "1989",
  "rt_score": "66",
  "poster": "https://m.media-amazon.com/images/I/51URcEemjTL._AC_.jpg",
  "roles": []
},{
  "_id": {
    "$oid": "61d7042cd2dd1c9fb1dabbdb"
  },
  "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
  "original_title": "Pirates of the Caribbean: The Curse of the Black Pearl",
  "description": "Capt. Jack Sparrow (Johnny Depp) arrives at Port Royal in the Caribbean without a ship or crew. His timing is inopportune, however, because later that evening the town is besieged by a pirate ship. The pirates kidnap the governor's daughter, Elizabeth (Keira Knightley), who's in possession of a valuable coin that is linked to a curse that has transformed the pirates into the undead. A gallant blacksmith (Orlando Bloom) in love with Elizabeth allies with Sparrow in pursuit of the pirates.",
  "director": "61d9b8e6f4d351b6f5e3adf3",
  "release_date": "2003",
  "rt_score": "79",
  "poster": "https://upload.wikimedia.org/wikipedia/en/8/89/Pirates_of_the_Caribbean_-_The_Curse_of_the_Black_Pearl.png",
  "roles": []
},{
  "_id": {
    "$oid": "61d7076fd2dd1c9fb1dabbdd"
  },
  "title": "The Hunger Games",
  "original_title": "The Hunger Games",
  "description": "In what was once North America, the Capitol of Panem maintains its hold on its 12 districts by forcing them each to select a boy and a girl, called Tributes, to compete in a nationally televised event called the Hunger Games. Every citizen must watch as the youths fight to the death until only one remains. District 12 Tribute Katniss Everdeen (Jennifer Lawrence) has little to rely on, other than her hunting skills and sharp instincts, in an arena where she must weigh survival against love.",
  "director": "61d9c906f4d351b6f5e3adf5",
  "release_date": "2012",
  "rt_score": "84",
  "poster": "https://resizing.flixster.com/wlmIV6X5aZH5RQ3rU466MIeSuSo=/206x305/v2/https://flxt.tmsimg.com/assets/p8648012_p_v10_ab.jpg",
  "id": "61d7076fd2dd1c9fb1dabbee",
  "roles": []
},{
  "_id": {
    "$oid": "61d70815d2dd1c9fb1dabbde"
  },
  "title": "The Lord of the Rings: The Fellowship of the Ring",
  "original_title": "The Lord of the Rings: The Fellowship of the Ring",
  "description": "The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed it in the hands of a young Hobbit named Frodo Baggins (Elijah Wood), who inherits the Ring and steps into legend. A daunting task lies ahead for Frodo when he becomes the Ringbearer - to destroy the One Ring in the fires of Mount Doom where it was forged.",
  "director": "61d9b90df4d351b6f5e3adf4",
  "release_date": "2001",
  "rt_score": "92",
  "poster": "https://flxt.tmsimg.com/assets/p28828_p_v10_am.jpg",
  "roles": []
},{
  "_id": {
    "$oid": "61d7092b74569e80206914f1"
  },
  "title": "The Lord of the Rings: The Two Towers",
  "original_title": "The Lord of the Rings: The Two Towers",
  "description": "The sequel to the Golden Globe-nominated and AFI Award-winning \"The Lord of the Rings: The Fellowship of the Ring,\" \"The Two Towers\" follows the continuing quest of Frodo (Elijah Wood) and the Fellowship to destroy the One Ring. Frodo and Sam (Sean Astin) discover they are being followed by the mysterious Gollum. Aragorn (Viggo Mortensen), the Elf archer Legolas and Gimli the Dwarf encounter the besieged Rohan kingdom, whose once great King Theoden has fallen under Saruman's deadly spell.",
  "director": "61d9b90df4d351b6f5e3adf4",
  "release_date": "2002",
  "rt_score": "95",
  "poster": "https://www.themoviedb.org/t/p/original/rrGlNlzFTrXFNGXsD7NNlxq4BPb.jpg",
  "roles": []
},{
  "_id": {
    "$oid": "61d7459d5d653d2c1e48ef44"
  },
  "title": "The Lord of the Rings: The Return of the King",
  "original_title": "The Lord of the Rings: The Return of the King",
  "description": "The culmination of nearly 10 years' work and conclusion to Peter Jackson's epic trilogy based on the timeless J.R.R. Tolkien classic, \"The Lord of the Rings: The Return of the King\" presents the final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the `one ring', while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
  "director": "61d9b90df4d351b6f5e3adf4",
  "release_date": "2003",
  "rt_score": "93",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzA5ZDNlZWMtM2NhNS00NDJjLTk4NDItYTRmY2EwMWZlMTY3XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
  "roles": []
},{
  "_id": {
    "$oid": "61d99cc9a510c0e65b977435"
  },
  "title": "Back to the Future Part III",
  "original_title": "Back to the Future Part III",
  "description": "In this final chapter, Marty McFly (Michael J. Fox) obtains a 70-year-old message from the time-traveling Dr. Emmett Brown (Christopher Lloyd), in which he informs Marty that he has retired to a small town in the Old West. Marty then finds out that the Doc was murdered shortly after sending the letter. In order to save his friend, Marty will have to travel back in time, disentangle a lovestruck Doc from a local schoolmarm, and repair the DeLorean -- all while avoiding a posse of gunslingers. ",
  "director": "61d9b828f4d351b6f5e3adf0",
  "release_date": "1990",
  "rt_score": "80",
  "poster": "https://flxt.tmsimg.com/assets/p12494_d_v8_aa.jpg",
  "roles": []
}]